runs/stateful/full_paper/exp1_ttft_reduction_llama3_sglang/sglang_runs/meta-llama_Meta-Llama-3-8B-Instruct/ctx4096_out64_a16_b8_s0/sglang_bench_raw.txt
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=50008, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', model='meta-llama/Meta-Llama-3-8B-Instruct', served_model_name=None, tokenizer='meta-llama/Meta-Llama-3-8B-Instruct', num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=64, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:50008/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=50008, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', model='meta-llama/Meta-Llama-3-8B-Instruct', served_model_name=None, tokenizer='meta-llama/Meta-Llama-3-8B-Instruct', num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=64, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)

#Input tokens: 68276
#Output tokens: 954
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 not set   
Successful requests:                     32        
Benchmark duration (s):                  3.38      
Total input tokens:                      68276     
Total input text tokens:                 68276     
Total generated tokens:                  954       
Total generated tokens (retokenized):    954       
Request throughput (req/s):              9.47      
Input token throughput (tok/s):          20207.40  
Output token throughput (tok/s):         282.35    
Peak output token throughput (tok/s):    485.00    
Peak concurrent requests:                32        
Total token throughput (tok/s):          20489.75  
Concurrency:                             28.80     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   3041.27   
Median E2E Latency (ms):                 3036.75   
P90 E2E Latency (ms):                    3318.57   
P99 E2E Latency (ms):                    3358.71   
---------------Time to First Token----------------
Mean TTFT (ms):                          1633.62   
Median TTFT (ms):                        1744.08   
P99 TTFT (ms):                           2736.53   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          92.00     
Median TPOT (ms):                        50.93     
P99 TPOT (ms):                           730.21    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           48.86     
Median ITL (ms):                         9.49      
P95 ITL (ms):                            10.99     
P99 ITL (ms):                            1723.03   
Max ITL (ms):                            2537.66   
==================================================


  0%|          | 0/32 [00:00<?, ?it/s]
  3%|▎         | 1/32 [00:01<00:58,  1.88s/it]
  6%|▋         | 2/32 [00:02<00:39,  1.33s/it]
 31%|███▏      | 10/32 [00:02<00:04,  5.41it/s]
 53%|█████▎    | 17/32 [00:03<00:01, 10.38it/s]
 69%|██████▉   | 22/32 [00:03<00:00, 13.67it/s]
 84%|████████▍ | 27/32 [00:03<00:00, 17.70it/s]
100%|██████████| 32/32 [00:03<00:00,  9.51it/s]